app/controllers/events_controller.rb

SELECT * FROM `events`
---
  def index
    @events = Event.all

SELECT * FROM `events` WHERE (`events`.`id` = 1)
---
  def edit
    @event = Event.find(params[:id])

INSERT INTO `events` (`created_at`, `title`, `updated_at`, `date`, `site`, `description`) VALUES('2009-12-02 22:21:34', NULL, '2009-12-02 22:21:34', NULL, NULL, NULL)
---
  def create
    @event = Event.new(params[:event])

    respond_to do |format|
      if @event.save