app/controllers/marine_controller.rb

	def index
		@marine = Marine.find(params[:id])
---
SELECT * FROM `marines` WHERE (`marines`.`id` = 1)